Revit 2026 API

# ScheduleFilterGetStringValue Method

---

Gets the filter value for a filter using a string value.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string GetStringValue()
```
```vb
Public Function GetStringValue As String
```
```cpp
public:
String^ GetStringValue()
```
```fsharp
member GetStringValue : unit -> string
```

#### Return Value

String The filter value.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The filter value is not a string. |

#### Reference

ScheduleFilter Class

Autodesk.Revit.DB Namespace